from PyQt5.QtCore import QTime
win_x, win_y = 200, 100
win_width, win_height = 1000, 600

txt_hello = ("Ласкаво просимо до програми визначення стану здоров'я!")
txt_next = ('Почати')
txt_instruction = ("Ця програма дозволить вам за допомогою тесту Руф'є провести первинну діагностику вашого здоров'я.\n"
"Проба Руф'є є навантажувальним комплексом, призначенним для оцінки працездатності серця при фізичному навантаженні\n"
"У випробованого, зо знаходиться в положенні лежачи на спину протягом 5 хвилин, визначають частоту пульсу за 15 секунд;\n"
"Після закінчення навантаження випробуваний лягає, і в нього знову підраховується кількість пульсацій за перші 15 секунд\n"
"А потім - за останні 15 секунд першої хвилини періоду відновлення.\n"
"Важливо! Якщо у процесі проведення випробування ви відчуваєте себе погано (з'явиться запаморочення, шум\n"
"у вухах, сильна задишка та ін.), то тест необхідно перервати і звернутися до лікаря.")
txt_title = ("Здоров'я")
txt_name = ("Введіть прізвище, ім'я, по-батькові:")
txt_hintname = ("П.І.Б")
txt_hintage = ("0")
txt_test1 = ('Ляжте на спину, заміряйте пульс на 15 секуд. Натисніть кнопку "Почати перший тест", щоб запустити таймер.\n'
'Результат запишіть у відповідне поле.')
txt_test2 = ('Виконайте 30 присідань за 45 секунд. Для цього натисніть кнопку "Почати робити присідання", щоб запустити лічильник присідань')
txt_test3 = ('Ляжте на спину, заміряйте пульс спочатку за перші 15 секунд хвилини, потім за останні 15 секунд. Хвилини без виміру пульсацій. Результати запишіть у відповідні поля.')
txt_sendresults = ('Надіслати результати')
txt_hinttest1 = ('0')
txt_hinttest2 = ('0')
txt_hinttest3 = ('0')
txt_starttest1 = ('Почати перший тест')
txt_starttest2 = ('Почати робити присідання')
txt_starttest3 = ('Почати фінальний тест')

txt_age = ('Повних років:')
txt_finalwin = ('Надіслати результати')
time = QTime(0, 0, 15)
text_timer = time.toString("hh:mm:ss")
txt_index = ("Індекс Руф'є:")
txt_workheart = ('Працездатність серця:')
txt_res1 = ("Низька. Терміново зверніться до лікаря!")
txt_res2 = ("Задовільна. Зверніться до лікаря!")
txt_res3 = ("Середня. Можливо, варто додатково обстежитись у лікаря.")
txt_res4 = ("Вище середнього")
txt_res5 = ("Висока")